test/xml/get_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nam="http://www.bipro.net/namespace">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsc:SecurityContextToken xmlns:wsc="http://schemas.xmlsoap.org/ws/2005/02/sc">
                <wsc:Identifier></wsc:Identifier>
            </wsc:SecurityContextToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <nam:GetShipment Version="1.4.1.0">
            <nam:Id>24733</nam:Id>
        </nam:GetShipment>
    </soapenv:Body>
</soapenv:Envelope>